import { useNavigate } from "react-router-dom"
import "./about.sass"
import Flex from "src/components/Flex/Flex"
import FadeIn from "src/components/FadeIn/FadeIn"
import MaterialIcon from "src/shared/icons/Materialicons"
import { LINK_APK } from "src/api/PREFIX"
interface AboutProps {}
const About = ({}: AboutProps) => {
  const navigate = useNavigate()

  return (
    <FadeIn>
      <Flex column centerV spredV className="about">
        <h2 className="tacenter">ІНСТРУКЦІЯ, ЩО ДО ВИКОРИСТАННЯ</h2>
        <div className="list">
          <ul>
            <h3>Реєстрація та вхід</h3>
            <li>Щоб користуватися додатком зареєструйтеся або увійдіть.</li>
            <li>Важливий лише логін та пароль, усе інше у довільній формі.</li>
            <li>Щоб вийти, натисніть на іконку вихід та червону кнопку.</li>

            <h3>Сторінка "Рибалки"</h3>
            <li>
              Тут ви можете продивитися свої записи, та записи інших
              користувачів.
            </li>
            <li>Тут також Ви знайдете перелік платних водойм.</li>
            <li>
              У пошуку Ви можете відфільтрувати записи по назві, або за
              інформацією у опису.
              <br /> (Ведіть назву риби, і якщо, в опису до місця автор написав,
              що ловив, то Ви побачите ці записи)
            </li>

            <li>Нитиснувши на запис, Ви перейдете до детальної інформайії.</li>
            <h3>Детальна інформація про місце</h3>
            <li>
              Тут Ви знайдете всю інформацію про запис, фото що додав автор,
              коментарі, та погодні умови під час створення запису. <br /> Ви
              також можете залишити свій коментар до цого запису.
            </li>
            <li>
              Якщо Ви автор цього запису, Ви можете додавати або видаляти фото,
              оновлювати інформацію, або видалити запис.
            </li>
            <li>
              Коментарі можуть залишати усі користувачі. Видалити коментар може
              тільки тей, хто його залишив.
            </li>
            <li>
              Також тут є ссилки на координати місця. Місце можна подивитися на
              карті додатку, або увійди у Google Maps.
            </li>
            <li>
              Погодні умови встановлюються автоматично, у момент створення
              запису, за Вашими координатами.
            </li>
            <h3>Як додати запис:</h3>
            <li>Фіолетова мітка показує Ваше місце знаходження.</li>
            <li>
              Щоб додати запис, натисніть на місце на карті, де Ви ловите.
            </li>
            <li>Натисніть на 'додати місце'.</li>
            <li>Заповніть всі поля.</li>
            <li>Натисніть 'Створити'.</li>
            <li>Після створення запису, Ви можете додати фото.</li>
            <h3>Розіл 'Карта':</h3>
            <li>Фіолетова мітка показує Ваше місце знаходження.</li>
            <li>
              Натиснувши на 'Всі місця', на карті з'являться всі мітки записів
              що є у базі.
            </li>
            <li>У фільтрі ви можете вибрати що Вас цікавить.</li>
            <li>
              Натиснувши на мітку ви побачите назву місця, натисніть на неї,
              <br /> і Ви перейдете до детальної інформації про це місце.
            </li>
            <h3>Для смартфонів</h3>
            <a href={LINK_APK}>
              <li>На даний момент є тільки додаток для android.</li>
            </a>
            <li>
              Завантаження по прямій ссилці з google drive, тому буде
              попередження!
            </li>
            <li>Методи роботи додатка аналогічні веб-версії</li>
          </ul>
        </div>
        <br />
        <br />
        <h4 className="tacenter COLORACCENT">
          Уся інформація у загальному користуванні!
        </h4>
        <h4 className="tacenter COLORACCENT">
          Усі користувачі можуть бачити усі місця!
        </h4>
        <a href={LINK_APK}>
          <h4 className="tacenter COLORACCENT">download android apk</h4>
        </a>
        <br />

        <Flex className="about__back" onClick={() => navigate(-1)}>
          <h1>
            <MaterialIcon name="MdArrowBackIos" />
          </h1>
        </Flex>
      </Flex>
    </FadeIn>
  )
}

export default About
